<?php
return [
    'welcome'         => [
        'name'                      => 'دفع النقود',
        'version'                   => 'v2.3',
        'title'                     => 'مرحبًا بك في برنامج التثبيت!',
        'message'                   => 'سهل التثبيت والإعداد المعالج',
        'requirementcheckingbutton' => 'ابدأ بالتحقق من المتطلبات',
        'serverrequirements'        => 'متطلبات الخادم',
        'back_button'               => 'الى الخلف',
        'check_permission'          => 'تحقق الأذونات',
        'serverpermissions'         => 'أذونات المجلد',
        'check_perchase_code'       => 'تحقق من Envato رمز الشراء',
        'verify_code_title'         => 'تحقق من Envato رمز الشراء',
        'envato_label_text'         => 'Envato رمز الشراء',
        'envato_placeholder_text'   => 'أدخل رمز الشراء',
        'verify_button'             => 'تحقق من رمز الشراء',
        'current_text'              => 'تيار',
        'version_text'              => 'الإصدار',
        'required_text'             => 'مطلوب',
        'cancel'                    => 'إلغاء',

    ],
    'database'        => [
        'title'          => 'إعداد قاعدة البيانات',
        'sub-title'      => 'إذا كنت لا تعرف كيفية ملء هذا النموذج ، فاتصل بالاستضافة',
        'dbname-label'   => 'اسم قاعدة البيانات (حيث تريد أن يكون التطبيق الخاص بك)',
        'username-label' => 'اسم المستخدم (دخول قاعدة البيانات الخاصة بك)',
        'password-label' => 'كلمة المرور (كلمة مرور قاعدة البيانات الخاصة بك)',
        'host-label'     => 'اسم المضيف (يجب أن يكون "localhost" ، إذا كان لا يعمل اسأل المضيف)',
        'wait'           => 'قليل من الصبر ...',
        'dbbutton'       => 'إنشاء قاعدة بيانات',

    ],
    'database-error'  => [
        'title'     => 'خطأ في اتصال قاعدة البيانات',
        'sub-title' => 'لا يمكننا الاتصال بقاعدة البيانات باستخدام إعداداتك:',
        'item1'     => 'هل أنت متأكد من اسم المستخدم وكلمة المرور الخاصة بك؟',
        'item2'     => 'هل أنت متأكد من اسم المضيف الخاص بك؟',
        'item3'     => 'هل أنت متأكد من أن خادم قاعدة البيانات يعمل؟',
        'message'   => 'إذا لم تكن متأكدًا تمامًا من فهم جميع هذه الشروط ، فيجب عليك الاتصال بمضيفك.',
        'button'    => 'حاول ثانية !',

    ],
    'register'        => [
        'title'              => 'إنشاء المسؤول',
        'sub-title'          => 'الآن يجب عليك إدخال المعلومات لإنشاء مسؤول',
        'base-label'         => 'ك',
        'message'            => 'ستحتاج إلى كلمة المرور لتسجيل الدخول ، لذا احتفظ بها في أمان!',
        'create_user_button' => 'إنشاء المستخدم',

    ],
    'register-fields' => [
        'first_name' => 'الاسم الاول',
        'last_name'  => 'الكنية',
        'email'      => 'البريد الإلكتروني',
        'password'   => 'كلمه السر',

    ],
    'end'             => [
        'title'     => 'نجاح التثبيت!',
        'sub-title' => 'التطبيق وتثبيته الآن ويمكنك استخدامه',
        'login'     => 'تسجيلك :',
        'password'  => 'كلمة السر خاصتك :',
        'button'    => 'تسجيل الدخول',

    ]];
