<?php
return [
    'welcome'         => [
        'name'                      => 'Платить деньги',
        'version'                   => 'v2.3',
        'title'                     => 'Добро пожаловать в установщик!',
        'message'                   => 'Мастер простой установки и настройки',
        'requirementcheckingbutton' => 'Начните с проверки требований',
        'serverrequirements'        => 'Требования к серверу',
        'back_button'               => 'назад',
        'check_permission'          => 'Проверьте разрешения',
        'serverpermissions'         => 'Разрешения для папок',
        'check_perchase_code'       => 'Проверить код покупки Envato',
        'verify_code_title'         => 'Проверить код покупки Envato',
        'envato_label_text'         => 'Код покупки Envato',
        'envato_placeholder_text'   => 'Введите код покупки',
        'verify_button'             => 'Проверить код покупки',
        'current_text'              => 'Текущий',
        'version_text'              => 'версия',
        'required_text'             => 'требуется',
        'cancel'                    => 'отменить',

    ],
    'database'        => [
        'title'          => 'Настройка базы данных',
        'sub-title'      => 'Если вы не знаете, как заполнить эту форму, свяжитесь с вашим хостингом.',
        'dbname-label'   => 'Имя базы данных (где вы хотите, чтобы ваше приложение было)',
        'username-label' => 'Имя пользователя (Ваш логин базы данных)',
        'password-label' => 'Пароль (пароль вашей базы данных)',
        'host-label'     => 'Имя хоста (должно быть "localhost", если оно не работает, спросите вашего хостера)',
        'wait'           => 'Немного терпения ...',
        'dbbutton'       => 'Создать базу данных',

    ],
    'database-error'  => [
        'title'     => 'Ошибка подключения к базе данных',
        'sub-title' => 'Мы не можем подключиться к базе данных с вашими настройками:',
        'item1'     => 'Вы уверены, что ваше имя пользователя и пароль?',
        'item2'     => 'Вы уверены, что ваше имя хоста?',
        'item3'     => 'Вы уверены, что ваш сервер базы данных работает?',
        'message'   => 'Если вы не уверены, что понимаете все эти условия, вам следует обратиться к вашему хостеру.',
        'button'    => 'Попробуйте снова !',

    ],
    'register'        => [
        'title'              => 'Создание администратора',
        'sub-title'          => 'Теперь необходимо ввести информацию для создания администратора',
        'base-label'         => 'Ваш',
        'message'            => 'Для входа вам понадобится пароль, так что держите его в безопасности!',
        'create_user_button' => 'Создать пользователя',

    ],
    'register-fields' => [
        'first_name' => 'Имя',
        'last_name'  => 'Фамилия',
        'email'      => 'Эл. адрес',
        'password'   => 'пароль',

    ],
    'end'             => [
        'title'     => 'Удачной установки!',
        'sub-title' => 'Приложение и сейчас установлено, и вы можете использовать его',
        'login'     => 'Ваш логин:',
        'password'  => 'Ваш пароль :',
        'button'    => 'Авторизоваться',

    ]];
